app/views/dashboard/index.html.erb

        <td><%= link_to 'Destroy', post, method: :delete, data: { confirm: 'Are you sure?' } %></td>
        <td><%= link_to "#{post.comments.size} Show Comments", post_comments_path(post) %></td>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", "4"]]