app/views/comments/_comment.html.erb

    <p ><%= comment.content %></p>
    <p><%= comment.created_at %></p>
---
INSERT INTO "comments" ("title", "content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "lalala"], ["content", "lalalala"], ["user_id", 1], ["post_id", "7"], ["created_at", "2021-10-18 17:42:57.264561"], ["updated_at", "2021-10-18 17:42:57.264561"]]