app/controllers/comments_controller.rb

  def index
    @comments = @post.comments.order(created_at: :desc)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" DESC  [["post_id", "6"]]

  def create
    @comment = @post.comments.create(comment_params)
    @comment.update!(user: current_user)
---
INSERT INTO "comments" ("title", "content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "asdasd"], ["content", "asdasd"], ["user_id", 1], ["post_id", "7"], ["created_at", "2021-10-17 18:05:52.611081"], ["updated_at", "2021-10-17 18:05:52.611081"]]
UPDATE "comments" SET "updated_at" = $1, "accepted" = $2 WHERE "comments"."id" = $3  [["updated_at", "2021-10-11 21:14:00.739417"], ["accepted", true], ["id", 6]]

  def show
    @comment = @post.comments.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", "7"], ["id", 45], ["LIMIT", 1]]

  def accept
  @comment = @post.comments.find(params[:id])
  @comment.update(accepted: true)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", "6"], ["id", 14], ["LIMIT", 1]]
UPDATE "comments" SET "updated_at" = $1, "accepted" = $2 WHERE "comments"."id" = $3  [["updated_at", "2021-10-17 18:32:45.340670"], ["accepted", true], ["id", 14]]

  def deny
  @comment = @post.comments.find(params[:id])
  @comment.update(accepted: false)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", "6"], ["id", 48], ["LIMIT", 1]]
UPDATE "comments" SET "updated_at" = $1, "accepted" = $2 WHERE "comments"."id" = $3  [["updated_at", "2021-10-22 18:08:16.343288"], ["accepted", false], ["id", 48]]

     def object_expire
       @comment = @post.comments.find(params[:id])
      if comment_expired?(@comment.created_at)
        @comment.update!(accepted: true)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", "7"], ["id", 45], ["LIMIT", 1]]
UPDATE "comments" SET "updated_at" = $1, "accepted" = $2 WHERE "comments"."id" = $3  [["updated_at", "2021-10-22 20:06:20.809766"], ["accepted", true], ["id", 45]]