app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "visible", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Deneme Post"], ["content", "asdasd"], ["visible", false], ["created_at", "2021-10-17 17:01:49.194180"], ["updated_at", "2021-10-17 17:01:49.194180"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "visible" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["visible", false], ["updated_at", "2021-10-11 22:09:32.645575"], ["id", 6]]