app/controllers/posts_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."accepted" = $2 ORDER BY "comments"."created_at" DESC  [["post_id", "7"], ["accepted", true]]
---
  def show
    @comments = @post.comments.accepteds.order(created_at: :desc)

UPDATE "posts" SET "updated_at" = $1, "vote_count" = $2 WHERE "posts"."id" = $3  [["updated_at", "2021-10-22 18:30:51.940881"], ["vote_count", 1], ["id", 33]]
---
  def up_vote
    @post.update!(vote_count: @post.vote_count + 1)

UPDATE "posts" SET "updated_at" = $1, "vote_count" = $2 WHERE "posts"."id" = $3  [["updated_at", "2021-10-22 18:30:56.353506"], ["vote_count", 0], ["id", 33]]
---
  def down_vote
    @post.update!(vote_count: @post.vote_count - 1)