app/controllers/relationships_controller.rb

  def destroy

     @user = Relationship.find(params[:id]).follwed
---
SELECT "relationships".* FROM "relationships" WHERE "relationships"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]